soapwsxquerytransformation/ViewAccountDataInput.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://webservice.flhk.com/FLHKWebService/1.0">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:viewAccountData>
         <transactionId>1000</transactionId>
         <ns:familyAccountId>82000000</ns:familyAccountId>
      </ns:viewAccountData>
   </soapenv:Body>
</soapenv:Envelope>